'use strict'


// ++++++++++++++++++++++++++++ Вывод элементов массива в консоль ++++++++++++++++++++++++++++++




// Вариант_1 ===================================================================================

// // Цикл "for"

// let array = [3,1,5];
// for (let i = 0; i<array.length; i++) {
//     console.log  ('Массив "array" - ' + array + '; ' + 'элемент массива - ' + array[i] + '; ' + 'номер элемента в массиве - ' + [i] + '.')
// };




// Вариант_2 ===================================================================================

// Метод "forEach"; обычная функция; шаблонная запись

// let array = [3,1,5];
// array.forEach (function funArrayBackValueId(value, id ){
//     console.log (`Массив "array" [${array}]; номер элемента в массиве - ${id}; элемент массива - ${value}.`)
// });




// Вариант_3 ===================================================================================

// Метод "forEach"; стрелочная функция; шаблонная запись   ====================================

// let array = [3,1,5];
// array.forEach ((value, id) => {
//     console.log (`Массив "array" [${array}]; номер элемента в массиве - ${id}; элемент массива - ${value}.`)
// });



// Вариант_4 ===================================================================================

// Цикл "while"; генерация массива с использованием методов random и floor; стрелочная функция; шаблонная запись   ====================================

// let array = [];
// let i = 0;
// while (i<10){
//     array.push(Math.floor(Math.random()*10));
//     i++;
// }
// array.forEach ((value, id) => {
//     console.log (`Массив "array" [${array}]; номер элемента в массиве - ${id}; значение элемента  - ${value}.`)
// });



// Вариант_5 ===================================================================================

// Цикл "for"; генерация массива с использованием методов random и floor; шаблонная запись   =========================

// let array = [];
// for (let i = 0; i<10; i++) {
//     array.push(Math.floor(Math.random()*10))
//     console.log(`Массив "array" [${array}]; номер элемента в массиве - ${i}; значение элемента  - ${array.at(i)}.`)
// };